OpenFOAM-dev/tutorials/multiRegion/CHT/heatedDuct/constant/heater/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/heater";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIsoSolid;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    // Iron

    specie
    {
        molWeight       50;
    }
    equationOfState
    {
        rho             8000;
    }
    transport
    {
        kappa           80;
    }
    thermodynamics
    {
        hf              0;
        Cv              450;
    }
}

// ************************************************************************* //
