OpenFOAM-dev/tutorials/multiRegion/CHT/heatedDuct/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-0.001 -10.001  -0.001)
    (50.001 -10.001  -0.001)
    (50.001  50.001  -0.001)
    (-0.001  50.001  -0.001)
    (-0.001 -10.001 150.001)
    (50.001 -10.001 150.001)
    (50.001  50.001 150.001)
    (-0.001  50.001 150.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 24 60) simpleGrading (1 1 1)
);

defaultPatch
{
    type patch;
}

boundary
(
);

// ************************************************************************* //
